class @PopupData

  @popupData : [
    id: 4
    body:
      name: "РАМП / RUMP",
      discription:
        text: ["Большой кусок, состоящий из мышц, окружающих нижние позвонки и тазовую кость.", "Подходит для тушения и приготовления ростбифов. Из лучшей части получаются вкусные бифштексы и жаркое."]
        img: ["rump.png"]

      recipe:
        img: "kostrets3.png"
        header: "Говядина с апельсинами"
        components: "мясо - 500г, морковь, лук, петрушка (корень), душистый перец горошком. лавровый лист, мука - 1.5 ст.л., масло растительное, апельсин - 1 шт."
        cooking: "Мясо обжарить, добавить воды, зелень и перец. Тушить 2-3 часа. За 30-40 минут до окончания тушения добавить 1 ст. л муки, поджаренной с маслом. К готовому мясу добавить порезанный апельсин, Цедру апельсина нарезать соломкой, опустить на 1 минуту в кипящую воду, влить в емкость с мясом и довести до кипения."
  ,
    id: 9
    body:
      name: "ГРУДИНКА / BRISKET"
      discription:
        text: ["После удаления грудной кости и ребер остается длинный плоский кусок мяса, который обычно сворачивают в рулет и обвязывают — это и есть грудинка.", "Иногда её тушат, но чаще отваривают либо свежую, либо солёную (грудинка традиционно используется для засола), иногда коптят."]
        img: ["brisket.png"]

      recipe:
        img: "grudinka3.png"
        header: "Говядина с капустой"
        components: "квашеная капуста 800 г, говяжья грудинка 500 г, сухие белые грибы 50 г, большая луковица, мука, сметана, растительное масло, соль, перец"
        cooking: "Нарезать мясо. Лук измельчить и обжарить, добавить мясо и готовить 8 мин. Грибы залить стаканом воды, довести до кипения и перелить в кастрюлю с мясом. Добавить муку. Влить сметану, и готовить 15 мин. Капусту отжать, добавить к мясу. Тушить под крышкой 30 мин."
  ,
    id: 13
    body:
      name: "ПЕРЕДНЯЯ ГОЛЕНЬ / FRONT SHIN"
      discription:
        text: ["Голень говяжья отличается присутствием большого количества сухожилий, высоким содержанием соединительной ткани и наличием мозговой кости.", "Мясо с голени в тушеном виде отличается особо тонким ароматом и чудесными вкусовыми качествами."]
        img: ["shin.png"]

      recipe:
        img: "pered_golen3.png"
        header: "Голень с овощами"
        components: "петрушка,  морковь, корень сельдерея, лук, голень (1, 8 кг.), 125 мл. белого вина"
        cooking: "Овощи порезать, обжаривать мясо, добавляя овощи. Смешать вино с 250 мл. воды. Смесь вливать мелкими порциями. Запекать мясо в духовке в течение 2 часов 30 минут."
  ,
    id: 12
    body:
      name: "ЗАДНЯЯ ГОЛЕНЬ / HIND SHIN"
      discription:
        text: ["Голень говяжья отличается присутствием большого количества сухожилий, высоким содержанием соединительной ткани и наличием мозговой кости.", "Мясо с голени в тушеном виде отличается особо тонким ароматом и чудесными вкусовыми качествами."]
        img: ["shin.png"]

      recipe:
        img: "zad_golen3.png"
        header: "Голень с овощами"
        components: "петрушка,  морковь, корень сельдерея, лук, голень (1, 8 кг.), 125 мл. белого вина"
        cooking: "Овощи порезать, обжаривать мясо, добавляя овощи. Смешать вино с 250 мл. воды. Смесь вливать мелкими порциями. Запекать мясо в духовке в течение 2 часов 30 минут."
  ,
    id: 7
    body:
      name: "ВЫРЕЗКА / TENDERLOIN"
      discription:
        text: [" Наиболее ценная часть туши животного, употребляемого в пищу." , "В течение жизни животного данная мышечная ткань почти не получает физической нагрузки, поэтому является наиболее нежным и вкусным при приготовлении мясом."]
        img: ["tenderloin.png"]

      recipe:
        img: "virezka3.png"
        header: "Бифштекс по-чикагски"
        components: "говяжья вырезка – 170 гр. желток – 1 шт. лук – 1/2 шт. петрушка, соль, перец масло растительное "
        cooking: "Мясо отбить, посолить, поперчить, в центре куска сделать углубление и вылить сырой желток. Запечь в духовке до готовности мяса. Подавать с нарезанным луком и зеленью петрушки."
  ,
    id: 2
    body:
      name: "ТОЛСТЫЙ ФИЛЕЙ / CHUCK"
      discription:
        text: ["Толстый филей относится к первому сорту говядины." , "Это мясо прекрасно подходит для отваривания, из него можно приготовить гуляшь, бифстроганов или любые блюда из рубленного мяса (фарша)."]
        img: ["chuck.png"]

      recipe:
        img: "lopatka3.png"
        header: "Овощной суп"
        components: "морковь, лук, красный сладкий перец, 400 г картофеля, чеснок, оливковое масло,300 мл овощного бульона, соль, перец 200 мл томатного сока"
        cooking: "Сварить говяжий бульон. Мясо порезать кубиками. Порезать овощи.  Чеснок пожарить. Добавить овощи и потушить. К овощам влить 0,5 литра говяжьего бульона, довести до кипения и варить на в течение 10 минут. Добавить в суп томатный сок и еще раз довести до кипения. Добавить порезанную говядину."
  ,
    id: 8
    body:
      name: "ОКОВАЛОК / KNUCKLE"
      discription:
        text: ["Ценное мясо состоит из мышц верхней части бедра. Мясо нежирное. " , " Из наружной части можно приготовить рагу, а из внутренней - бифштексы с кровью."]
        img: ["knuckle.png"]

      recipe:
        img: "shup3.png"
        header: "Говядина с горгонцолой"
        components: "600 г говядины, 150 г горгонцолы, 100 мл сухого красного вина,луковица, 4 ст. л. оливкового масла,розмарин, перчик чили, соль, черный перец"
        cooking: "Обжарить лук и перчик, потушить. Говядину обжарить. Добавить вино и выпарить на две трети. Добавить розмарин. Поставить в духовку на 40 мин. Мясо нарезать ломтиками. Розмарин вынуть из соуса. Каждый ломтик намазать горгонцолой. Мясо полить соусом и запекать в духовке 10 минут."
  ,
    id: 3
    body:
      name: "ЗАДНЕЕ БЕДРО / SILVERSIDE"
      discription:
        text: ["Бедренная часть конечности туши, подходит для тушения, ростбифов, бифштексов, жаркого." , " Из наружной части можно приготовить рагу, а из внутренней - бифштексы с кровью."]
        img: ["silverside.png"]

      recipe:
        img: "zad_bedro3.png"
        header: "Ромштекс из говядины"
        components: "мясо, соль, перец, яйцо, молоко, сухари, жир для жарки"
        cooking: "Кусок разрезать поперек волокон на куски толщиной 1,5 - 2 см, отбить, разделать овальные ромштексы, посыпать солью, перцем, смочить яйцом, взбитым с небольшим количеством молока,обвалять в сухарях и жарить на сковороде в жиру. Поставить на 10 минут в духовку."
  ,
    id: 10
    body:
      name: "ЧЕЛЫШКО / BRISKET VARIATION: POINT"
      discription:
        text: ["Часть туши, прилегающая к грудинке и отчетливо выступающая вперед." , "Первосортное мясо, несколько хуже филея и оковалка из за соединительной ткани и жировой прослойки. Из него делают фарш и котлеты."]
        img: ["brisket-variations-point.png"]

      recipe:
        img: "chelishko3.png"
        header: "Суп Харчо"
        components: "мясо 500г, лук, рис - 1/3 ст, помидоры, ткемали, грецкие орехи, кинза, петрушка, хмели-сунели, чеснок, красный перец, мука - 1 ч.л."
        cooking: "Сварить бульон из говядины, мясо вынуть. Лук обжарить, добавить муку. Довести бульон до кипения, положить рис, мясо, зелень и пряности. Рис варить 20 минут. За 5 минут до готовности риса добавить в суп толченые грецкие орехи, помидоры, зелень, пряности."
  ,
    id: 5
    body:
      name: "СТРИПЛОЙН / STRIPLOIN"
      discription:
        text: ["Стейки из этого отруба получаются весьма солидными по размеру, красивыми по форме, сочными, нежными и ароматными.", "Идеальная толщина куска мяса для приготовления стейка составляет около 2 см. Рекомендуемая степень прожарки – medium."]
        img: ["striploin.png"]

      recipe:
        img: "file3.png"
        header: "Говядина со шпинатом"
        components: "говядина 300 гр, 2 пучка водного шпината, чеснок, черный молотый перец, растительное масло, красный перец, соль"
        cooking: "Обжарить чеснок, добавить говядину,тушить до полуготовности, выложить на тарелку. Снова обжарить чеснок, бросить водный шпинат, тушить до готовности, добавить соль по вкусу. В сковородку с водным шпинатом добавить обжаренную ранее говядину, продолжать тушить до готовности. "
  ,
    id: 6
    body:
      name: "РИБАЙ / RIBEYE"
      discription:
        text: ["Сортовой отруб, содержащий 4 или 5 ребер с относительно мягким и тонковолокнистым мясом." , "Для приготовления превосходного ростбифа ребра обычно отпиливаются покороче, а мясо обвязывается; кости могут удаляться полностью, в этом случае перед обвязыванием мясо сворачивают в рулет."]
        img: ["ribeye.png"]

      recipe:
        img: "spinka3.png"
        header: "Ребрышки"
        components: "2кг ребрышек, 1/4 ст. коричневого сахара, 1/2 ст уксуса, куриный бульон, вода, томатная паста, чеснок, перец, горчица, гвоздика, перец чили"
        cooking: "Смешать уксус и сахар и кипятить пока смесь не загустеет. Добавить воду и остальные ингредиенты, кроме ребер. После кипения добавить ребра и оставить на 20 минут.Ребра выложить на фольгу и поставить в холодильник на ночь. На следующий день пожарить ребра на решетке."
  ,
    id: 11
    body:
      name: "ПАШИНА / THIN FLANK"
      discription:
        text: ["Пашина может быть свернута в рулет и отварена или нарезана ломтиками для тушения с овощами." , "Пашина хорошо подходит и для приготовления рубленой телятины. Из нее получаются отличные стейки, так как мясо ненагруженное, достаточно вкусное и хорошее. "]
        img: ["thin_flank.png"]

      recipe:
        img: "pashina3.png"
        header: "Гуляш по-венгерски"
        components: "500 г. красного лука, чеснок, 100 г. животного жира, 3 стол. ложки томатного соуса, 1 кг. говядины, красный перец, тмин, соль, корка с одного лимона."
        cooking: "Лук нарезать кружочками, чеснок измельчить, все пассировать. Влить томатный соус, положить мясо, добавить жир, перец, влить стакан воды, тушить. Минут за 7-10 до завершения процесса добавить тмин, тертую лимонную корку, соль, красный перец и залить сметаной."

  ]

  @getPartById: (id) ->
    selectedBody = null
    i = 0
    while i < @popupData.length
      selectedBody = @popupData[i].body  if @popupData[i].id == id
      i++
    selectedBody = @popupData[0].body  unless selectedBody?
    selectedBody
