class @PopupData

  @popupData : [
    id: 4
    body:
      name: "РАМП / RUMP",
      discription:
        text: ["Большой кусок, состоящий из мышц, окружающих нижние позвонки и тазовую кость.", "Подходит для тушения и приготовления ростбифов. Из лучшей части получаются вкусные бифштексы и жаркое."]
        img: ["rump.png"]

      recipe:
        img: "kostrets3.png"
        header: "Говядина с апельсинами"
        components: "мясо - 500г, морковь, лук, петрушка (корень), душистый перец горошком. лавровый лист, мука - 1.5 ст.л., масло растительное, апельсин - 1 шт."
        cooking: "Мясо обжарить, добавить воды, зелень и перец. Тушить 2-3 часа. За 30-40 минут до окончания тушения добавить 1 ст. л муки, поджаренной с маслом. К готовому мясу добавить порезанный апельсин, Цедру апельсина нарезать соломкой, опустить на 1 минуту в кипящую воду, влить в емкость с мясом и довести до кипения."
  ,
    id: 9
    body:
      name: "ГРУДИНКА / BRISKET"
      discription:
        text: ["После удаления грудной кости и ребер остается длинный плоский кусок мяса, который обычно сворачивают в рулет и обвязывают — это и есть грудинка.", "Иногда её тушат, но чаще отваривают либо свежую, либо солёную (грудинка традиционно используется для засола), иногда коптят."]
        img: ["brisket.png"]

      recipe:
        img: "grudinka.png"
        header: "Суп из грудинки"
        components: "мясо 500 гр., лук 100 гр., морковь 100 гр., корень сельдерея 100 гр., чеснок 10 гр., корень петрушки 50 гр., картофель 300 гр., раст. масло 30 гр., кинза 10 гр., соль и перец."
        cooking: "Грудинка сначала обжаривается в печи с овощами, затем варится на медленном огне в течение трех часов. После варки перед подачей грудинка слегка обжаривается на сковороде и выкладывается в тарелку с бульоном. Отдельно можно добавить в ароматный мясной бульон рубленый чеснок с кинзой. Украшается рубленой петрушкой."
  ,
    id: 13
    body:
      name: "ПЕРЕДНЯЯ ГОЛЕНЬ / FRONT SHIN"
      discription:
        text: ["Голень говяжья отличается присутствием большого количества сухожилий, высоким содержанием соединительной ткани и наличием мозговой кости.", "Мясо с голени в тушеном виде отличается особо тонким ароматом и чудесными вкусовыми качествами."]
        img: ["shin.png"]

      recipe:
        img: "ossobuko.png"
        header: "Оссобуко из говядины"
        components: "говядина 500 гр., лук 100 гр., морковь 100 гр., корень сельдерея 100 гр., чеснок 10 гр., тимьян 10 гр., том. соус 300 гр., соевый соус 20 гр., красн. вино 100 гр., раст. масло 30гр., соль и перец."
        cooking: "Обжариваются крупно нарезанные овощи, лук, морковь, корень сельдерея, чеснок и зелень тимьян. Добавляется томатный соус, соевый соус и красное вино. Мясо обжаривается на сильном огне и выкладывается в соус с овощами добавляется соль, перец и готовится на слабом огне под крышкой в течении 1,5-2 часа. Соус пробить блендером и процедить."
  ,
    id: 12
    body:
      name: "ЗАДНЯЯ ГОЛЕНЬ / HIND SHIN"
      discription:
        text: ["Голень говяжья отличается присутствием большого количества сухожилий, высоким содержанием соединительной ткани и наличием мозговой кости.", "Мясо с голени в тушеном виде отличается особо тонким ароматом и чудесными вкусовыми качествами."]
        img: ["shin.png"]

      recipe:
        img: "zad_golen3.png"
        header: "Голень с овощами"
        components: "петрушка,  морковь, корень сельдерея, лук, голень (1, 8 кг.), 125 мл. белого вина"
        cooking: "Овощи порезать, обжаривать мясо, добавляя овощи. Смешать вино с 250 мл. воды. Смесь вливать мелкими порциями. Запекать мясо в духовке в течение 2 часов 30 минут."
  ,
    id: 7
    body:
      name: "ВЫРЕЗКА / TENDERLOIN"
      discription:
        text: [" Наиболее ценная часть туши животного, употребляемого в пищу." , "В течение жизни животного данная мышечная ткань почти не получает физической нагрузки, поэтому является наиболее нежным и вкусным при приготовлении мясом."]
        img: ["tenderloin.png"]

      recipe:
        img: "tar_tar.png"
        header: "Тар-тар из говядины"
        components: "вырезка 100 гр., авокадо 50 гр., помидоры черри 30 гр., лук 5 гр., каперсы 10 гр., горчица Дижонская 5 гр., масло оливковое 20 гр., лайм 20 гр., соус Ворчестер 5 гр., бальзамический уксус 10 гр., переепелиное яйцо 2 шт., салат Руккола 10 гр., перец м соль по вкусу."
        cooking: "Вырезку и овощи порезать на кубиком. Смешать с мясом все ингредиенты, заправить маслом, горчицей, соком лайма и соусом Ворчестер и бальзамиком. На тарелку выложить листья салата Руколла, помидоры черри, через формовочное кольцо выложить тар-тар."
  ,
    id: 2
    body:
      name: "ТОЛСТЫЙ ФИЛЕЙ / CHUCK"
      discription:
        text: ["Толстый филей относится к первому сорту говядины." , "Это мясо прекрасно подходит для отваривания, из него можно приготовить гуляшь, бифстроганов или любые блюда из рубленного мяса (фарша)."]
        img: ["chuck.png"]

      recipe:
        img: "lopatka3.png"
        header: "Овощной суп"
        components: "морковь, лук, красный сладкий перец, 400 г картофеля, чеснок, оливковое масло,300 мл овощного бульона, соль, перец 200 мл томатного сока"
        cooking: "Сварить говяжий бульон. Мясо порезать кубиками. Порезать овощи.  Чеснок пожарить. Добавить овощи и потушить. К овощам влить 0,5 литра говяжьего бульона, довести до кипения и варить на в течение 10 минут. Добавить в суп томатный сок и еще раз довести до кипения. Добавить порезанную говядину."
  ,
    id: 8
    body:
      name: "ОКОВАЛОК / KNUCKLE"
      discription:
        text: ["Ценное мясо состоит из мышц верхней части бедра. Мясо нежирное. " , " Из наружной части можно приготовить рагу, а из внутренней - бифштексы с кровью."]
        img: ["knuckle.png"]

      recipe:
        img: "shup3.png"
        header: "Говядина с горгонцолой"
        components: "600 г говядины, 150 г горгонцолы, 100 мл сухого красного вина,луковица, 4 ст. л. оливкового масла,розмарин, перчик чили, соль, черный перец"
        cooking: "Обжарить лук и перчик, потушить. Говядину обжарить. Добавить вино и выпарить на две трети. Добавить розмарин. Поставить в духовку на 40 мин. Мясо нарезать ломтиками. Розмарин вынуть из соуса. Каждый ломтик намазать горгонцолой. Мясо полить соусом и запекать в духовке 10 минут."
  ,
    id: 3
    body:
      name: "ЗАДНЕЕ БЕДРО / SILVERSIDE"
      discription:
        text: ["Бедренная часть конечности туши, подходит для тушения, ростбифов, бифштексов, жаркого." , " Из наружной части можно приготовить рагу, а из внутренней - бифштексы с кровью."]
        img: ["silverside.png"]

      recipe:
        img: "zad_bedro3.png"
        header: "Ромштекс из говядины"
        components: "мясо, соль, перец, яйцо, молоко, сухари, жир для жарки"
        cooking: "Кусок разрезать поперек волокон на куски толщиной 1,5 - 2 см, отбить, разделать овальные ромштексы, посыпать солью, перцем, смочить яйцом, взбитым с небольшим количеством молока,обвалять в сухарях и жарить на сковороде в жиру. Поставить на 10 минут в духовку."
  ,
    id: 10
    body:
      name: "ЧЕЛЫШКО / BRISKET VARIATION: POINT"
      discription:
        text: ["Часть туши, прилегающая к грудинке и отчетливо выступающая вперед." , "Первосортное мясо, несколько хуже филея и оковалка из за соединительной ткани и жировой прослойки. Из него делают фарш и котлеты."]
        img: ["brisket-variations-point.png"]

      recipe:
        img: "chelishko3.png"
        header: "Суп Харчо"
        components: "мясо 500г, лук, рис - 1/3 ст, помидоры, ткемали, грецкие орехи, кинза, петрушка, хмели-сунели, чеснок, красный перец, мука - 1 ч.л."
        cooking: "Сварить бульон из говядины, мясо вынуть. Лук обжарить, добавить муку. Довести бульон до кипения, положить рис, мясо, зелень и пряности. Рис варить 20 минут. За 5 минут до готовности риса добавить в суп толченые грецкие орехи, помидоры, зелень, пряности."
  ,
    id: 5
    body:
      name: "СТРИПЛОЙН / STRIPLOIN"
      discription:
        text: ["Стейки из этого отруба получаются весьма солидными по размеру, красивыми по форме, сочными, нежными и ароматными.", "Идеальная толщина куска мяса для приготовления стейка составляет около 2 см. Рекомендуемая степень прожарки – medium."]
        img: ["striploin.png"]

      recipe:
        img: "steak.png"
        header: "Стриплойн стейк"
        components: "говядина 300 гр, растительное масло 10 мл., сливочное масло 10 гр., соль и перец."
        cooking: "Стейки смазывается растительным маслом. Стейк должен быть первоначально обжарен на сильном огне, чтобы поры закрылись, и получить хорошую зажаренную корочку. Далее стейк доводиться до требуемой степени прожарки(37-65 мин.). В конце жарки, стейк смазывается очищенным сливочным маслом, добавляется соль, перец и в течении минуту стейк должен отдохнуть, чтобы сок, который находится в мясе разошелся по всему стейку."
  ,
    id: 6
    body:
      name: "РИБАЙ / RIBEYE"
      discription:
        text: ["Сортовой отруб, содержащий 4 или 5 ребер с относительно мягким и тонковолокнистым мясом." , "Для приготовления превосходного ростбифа ребра обычно отпиливаются покороче, а мясо обвязывается; кости могут удаляться полностью, в этом случае перед обвязыванием мясо сворачивают в рулет."]
        img: ["ribeye.png"]

      recipe:
        img: "spinka3.png"
        header: "Ребрышки"
        components: "2 кг. ребрышек, 1/4 ст. коричневого сахара, 1/2 ст уксуса, куриный бульон, вода, томатная паста, чеснок, перец, горчица, гвоздика, перец чили"
        cooking: "Смешать уксус и сахар и кипятить пока смесь не загустеет. Добавить воду и остальные ингредиенты, кроме ребер. После кипения добавить ребра и оставить на 20 минут.Ребра выложить на фольгу и поставить в холодильник на ночь. На следующий день пожарить ребра на решетке."
  ,
    id: 11
    body:
      name: "ПАШИНА / THIN FLANK"
      discription:
        text: ["Пашина может быть свернута в рулет и отварена или нарезана ломтиками для тушения с овощами." , "Пашина хорошо подходит и для приготовления рубленой телятины. Из нее получаются отличные стейки, так как мясо ненагруженное, достаточно вкусное и хорошее. "]
        img: ["thin_flank.png"]

      recipe:
        img: "pashina3.png"
        header: "Гуляш по-венгерски"
        components: "500 г. красного лука, чеснок, 100 г. животного жира, 3 стол. ложки томатного соуса, 1 кг. говядины, красный перец, тмин, соль, корка с одного лимона."
        cooking: "Лук нарезать кружочками, чеснок измельчить, все пассировать. Влить томатный соус, положить мясо, добавить жир, перец, влить стакан воды, тушить. Минут за 7-10 до завершения процесса добавить тмин, тертую лимонную корку, соль, красный перец и залить сметаной."

  ]

  @getPartById: (id) ->
    selectedBody = null
    i = 0
    while i < @popupData.length
      selectedBody = @popupData[i].body  if @popupData[i].id == id
      i++
    selectedBody = @popupData[0].body  unless selectedBody?
    selectedBody
